app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    #get params from the route(url) from the route
    @article = Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 12]]
---
  def destroy
    @article = Article.find(params[:id]);
    @article.destroy